{
  "host": "127.0.0.1",
  "port": 50001,

  "graphics_mode": "minotauro",
  "image_directory": "./images/",

  "background_color": "lightgray",
  "step_color": "turquoise",
  "view_color": "red",

  "use_maps?": true,
  "object_dictionary": {
    " ": "free space",
    "O": "visible obstacle",
    "I": "invisible obstacle",
    "B": "bomb",
    "T": "targets",
    "A": "agents"
  },
  "object_map":[
    "OOOOOOOOOOOOOOOOO",
    "O           T   O",
    "O A      A      O",
    "O             T O",
    "O   T           O",
    "OOOOOOOOOOOOOOOOO"

  ],
  "weight_dictionary": {
    "1": 1,
    "2": 4,
    "3": 6,
    "4": 10,
    "R": "random"
  },
  "weight_map" : [
    "1111111111111111",
    "1111111111111111",
    "1111111111111111",
    "1111111111111111",
    "1111111111111111",
    "1111111111111111"
  ]
}
